-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: standards_db_v1.0
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `national_standard_indicator`
--

DROP TABLE IF EXISTS `national_standard_indicator`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `national_standard_indicator` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `std_code` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '国标号',
  `specific_indicator_value` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '国标具体指标值',
  `manual_review_status` enum('pending','approved','rejected') COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '人工审核状态(占位)',
  PRIMARY KEY (`id`),
  KEY `idx_national_standard_indicator_std_code` (`std_code`),
  CONSTRAINT `fk_nsi_std_code` FOREIGN KEY (`std_code`) REFERENCES `national_standard_basic` (`std_code`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=528 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='国标具体指标表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `national_standard_indicator`
--

LOCK TABLES `national_standard_indicator` WRITE;
/*!40000 ALTER TABLE `national_standard_indicator` DISABLE KEYS */;
INSERT INTO `national_standard_indicator` VALUES (444,'GB 1002-2024','带电插套离插合面的最小距离 | 图2: 8.0 mm',NULL),(445,'GB 1002-2024','带电插套离插合面的最小距离 | 图4: 10.0 mm',NULL),(446,'GB 1002-2024','带电插套离插合面的最小距离 | 图6: 11.5 mm',NULL),(447,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图2 / 带电插孔深度 H: 17.0 mm',NULL),(448,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图2 / 接地插孔深度 H: 不适用',NULL),(449,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图4 / 带电插孔深度 H: 19.0 mm',NULL),(450,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图4 / 接地插孔深度 H: 22.0 mm',NULL),(451,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图6 / 带电插孔深度 H: 20.5 mm',NULL),(452,'GB 1002-2024','插座插孔对应腔体的可插入插头插销的深度 | 图6 / 接地插孔深度 H: 23.5 mm',NULL),(453,'GB 1002-2024','插头带电插销根部离插头边缘的距离 | 最小距离: ≥6.5 mm',NULL),(454,'GB 1002-2024','插头插合面的凸起部分 | 最大高度: ≤0.5 mm',NULL),(455,'GB 1002-2024','插头插销绝缘护套高度 | 图1插头: 7.0+0.5 0 mm',NULL),(456,'GB 1002-2024','插头插销绝缘护套高度 | 图3和图5插头: 9.0+0.5 0 mm',NULL),(457,'GB 1002-2024','去除绝缘护套后插销本体的厚度 t | ≤10A: ≥1.0 mm',NULL),(458,'GB 1002-2024','去除绝缘护套后插销本体的厚度 t | 16A: ≥1.2 mm',NULL),(459,'GB 1002-2024','去除绝缘护套后插销本体的厚度 t | 32A: ≥1.7 mm',NULL),(460,'GB 1002-2024','去除绝缘护套后插销本体的宽度 w | ≤10A: ≥5.2 mm',NULL),(461,'GB 1002-2024','去除绝缘护套后插销本体的宽度 w | 16A: ≥6.7 mm',NULL),(462,'GB 1002-2024','去除绝缘护套后插销本体的宽度 w | 32A: ≥9.0 mm',NULL),(463,'GB 1002-2024','接地插套离插合面的距离 | 与带电插套距离关系: ≤同一插座的带电插套离插合面的距离',NULL),(464,'GB 10152-2009','基本性能要求 | 探测深度 / 线阵，R≥60凸阵；2.0≤f＜4.0: ≥160 mm',NULL),(465,'GB 10152-2009','基本性能要求 | 探测深度 / 线阵，R≥60凸阵；4.0≤f＜6.0: ≥140 mm',NULL),(466,'GB 10152-2009','基本性能要求 | 探测深度 / 线阵，R≥60凸阵；6.0≤f＜9.0: ≥100 mm',NULL),(467,'GB 10152-2009','基本性能要求 | 探测深度 / 线阵，R≥60凸阵；f≥9.0: ≥80 mm',NULL),(468,'GB 10152-2009','基本性能要求 | 探测深度 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0: ≥50 mm',NULL),(469,'GB 10152-2009','基本性能要求 | 探测深度 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0: ≥40 mm',NULL),(470,'GB 10152-2009','基本性能要求 | 探测深度 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0: ≥30 mm',NULL),(471,'GB 10152-2009','基本性能要求 | 探测深度 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0: ≥30 mm',NULL),(472,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；2.0≤f＜4.0 / 深度≤80: ≤3 mm',NULL),(473,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；2.0≤f＜4.0 / 80＜深度≤130: ≤4 mm',NULL),(474,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；4.0≤f＜6.0 / 深度≤80: ≤3 mm',NULL),(475,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；4.0≤f＜6.0 / 80＜深度≤130: ≤4 mm',NULL),(476,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；6.0≤f＜9.0 / 深度≤60: ≤2 mm',NULL),(477,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 线阵，R≥60凸阵；f≥9.0 / 深度≤40: ≤2 mm',NULL),(478,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0 / 深度≤30: ≤1 mm',NULL),(479,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0 / 深度≤30: ≤1 mm',NULL),(480,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0 / 深度≤40: ≤2 mm',NULL),(481,'GB 10152-2009','基本性能要求 | 侧向分辨力 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0 / 深度≤50: ≤2 mm',NULL),(482,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 线阵，R≥60凸阵；2.0≤f＜4.0 / 深度≤80: ≤2 mm',NULL),(483,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 线阵，R≥60凸阵；2.0≤f＜4.0 / 80＜深度≤130: ≤3 mm',NULL),(484,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 线阵，R≥60凸阵；4.0≤f＜6.0 / 深度≤80: ≤2 mm',NULL),(485,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 线阵，R≥60凸阵；6.0≤f＜9.0 / 深度≤40: ≤1 mm',NULL),(486,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 线阵，R≥60凸阵；f≥9.0 / 深度≤30: ≤0.5 mm',NULL),(487,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0 / 深度≤40: ≤1 mm',NULL),(488,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0 / 深度≤50: ≤1 mm',NULL),(489,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0 / 深度≤40: ≤1 mm',NULL),(490,'GB 10152-2009','基本性能要求 | 轴向分辨力 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0 / 深度≤30: ≤0.5 mm',NULL),(491,'GB 10152-2009','基本性能要求 | 盲区 / 线阵，R≥60凸阵；2.0≤f＜4.0: ≤5 mm',NULL),(492,'GB 10152-2009','基本性能要求 | 盲区 / 线阵，R≥60凸阵；4.0≤f＜6.0: ≤7 mm',NULL),(493,'GB 10152-2009','基本性能要求 | 盲区 / 线阵，R≥60凸阵；6.0≤f＜9.0: ≤4 mm',NULL),(494,'GB 10152-2009','基本性能要求 | 盲区 / 线阵，R≥60凸阵；f≥9.0: ≤5 mm',NULL),(495,'GB 10152-2009','基本性能要求 | 盲区 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0: ≤3 mm',NULL),(496,'GB 10152-2009','基本性能要求 | 盲区 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0: ≤4 mm',NULL),(497,'GB 10152-2009','基本性能要求 | 盲区 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0: ≤2 mm',NULL),(498,'GB 10152-2009','基本性能要求 | 盲区 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0: ≤3 mm',NULL),(499,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 线阵，R≥60凸阵；2.0≤f＜4.0: ≤15 %',NULL),(500,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 线阵，R≥60凸阵；4.0≤f＜6.0: ≤20 %',NULL),(501,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 线阵，R≥60凸阵；6.0≤f＜9.0: ≤15 %',NULL),(502,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 线阵，R≥60凸阵；f≥9.0: ≤20 %',NULL),(503,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0: ≤10 %',NULL),(504,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0: ≤10 %',NULL),(505,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0: ≤5 %',NULL),(506,'GB 10152-2009','基本性能要求 | 横向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0: ≤5 %',NULL),(507,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 线阵，R≥60凸阵；2.0≤f＜4.0: ≤10 %',NULL),(508,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 线阵，R≥60凸阵；4.0≤f＜6.0: ≤10 %',NULL),(509,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 线阵，R≥60凸阵；6.0≤f＜9.0: ≤10 %',NULL),(510,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 线阵，R≥60凸阵；f≥9.0: ≤10 %',NULL),(511,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；2.0≤f＜4.0: ≤5 %',NULL),(512,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；4.0≤f＜6.0: ≤5 %',NULL),(513,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；6.0≤f＜9.0: ≤5 %',NULL),(514,'GB 10152-2009','基本性能要求 | 纵向几何位置精度 / 相控阵，机械扇扫，R＜60凸阵；f≥9.0: ≤5 %',NULL),(515,'GB 10152-2009','声工作频率 | 声工作频率与标称频率偏差: ±15 %',NULL),(516,'GB 10152-2009','周长和面积测量偏差 | 周长和面积测量偏差: ±20 %',NULL),(517,'GB 10152-2009','M模式时间显示误差 | M模式性能指标: 应符合制造商在随机文件中公布的指标',NULL),(518,'GB 10152-2009','三维重建体积计算偏差 | 三维重建体积计算偏差: ±30 %',NULL),(519,'GB 10152-2009','电源电压适应范围 | 电源电压适应范围: 额定电压的±10 %',NULL),(520,'GB 10152-2009','连续工作时间 | 连续工作时间: >8 h',NULL),(521,'GB 10152-2009','外观和结构要求 | 外表: 色泽均匀、表面整洁，无划痕、裂缝等缺陷',NULL),(522,'GB 10152-2009','外观和结构要求 | 面板文字和标志: 清楚易认、持久',NULL),(523,'GB 10152-2009','外观和结构要求 | 控制和调节机构: 灵活、可靠，紧固部位无松动',NULL),(524,'GB 10152-2009','使用功能要求 | 使用功能: 应具备制造商在随机文件中规定的使用功能',NULL),(525,'GB 10152-2009','安全要求 | 通用安全: 应符合 GB 9706.1 的要求',NULL),(526,'GB 10152-2009','安全要求 | 医用电气系统安全: 若为医用电气系统则同时应符合 GB 9706.15 的要求',NULL),(527,'GB 10152-2009','安全要求 | 专用安全: 应符合 GB 9706.9 的要求',NULL);
/*!40000 ALTER TABLE `national_standard_indicator` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-22 10:52:07
